Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartBadConnectionSizeWarning Property
 The connection invalid due to connectors sizes are not the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartBadConnectionSizeWarning { get; }
Public Shared ReadOnly Property FabricationPartBadConnectionSizeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartBadConnectionSizeWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartBadConnectionSizeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace